/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.prototype
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月31日       qinjunjie        
 * ============================================================*/

/**
 * <p>PROTOTYPE </p>
 *原始模型模式：通过给出一个原型对象来指明所要创建的对象的类型，然后用
 *复制这个原型对象的方法创建出更多同类型的对象。原始模型模式允许动态的
 *增加或减少产品类，产品类不需要非得有任何事先确定的等级结构，原始模型
 *模式适用于任何的等级结构。缺点是每一个类都必须配备一个克隆方法。
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月31日
 */

package com.adaivskenan.gof.prototype;