/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.bridge
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月31日       qinjunjie        
 * ============================================================*/

/**
 * <p>BRIDGE</p>
 *桥梁模式：将抽象化与实现化脱耦，使得二者可以独立的变化，也就是说将
 *他们之间的强关联变成弱关联，也就是指在一个软件系统的抽象化和实现化之
 *间使用组合/聚合关系而不是继承关系，从而使两者可以独立的变化。
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月31日
 */

package com.adaivskenan.gof.bridge;