/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月30日       qinjunjie        
 * ============================================================*/

/**
 * <p>SINGLETON</p>
 * 单例模式：单例模式确保某一个类只有一个实例，而且自行实例化并向整个
 * 系统提供这个实例单例模式。单例模式只应在有真正的“单一实例”的需求时
 * 才可使用
 *
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月30日
 */

package com.adaivskenan.gof.singleton;