/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.proxy.dynamic
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年2月5日       qinjunjie        
 * ============================================================*/

/**
 * <p>Java的动态代理</p>
 *
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年2月5日
 */

package com.adaivskenan.gof.proxy.dynamic;

/**
 * Java的动态代理可以动态的创建代理并动态的处理对所代理方法的调用。
 * 	动态代理有两种实现方法，
 * 	一种是使用JDK自带的，一种是使用Cglib实现。
 * 
 * */
