/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.pattern
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月30日       qinjunjie        
 * ============================================================*/

/**
 * <p>常用的设计技巧或者模式</p>
 *
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月30日
 */

package com.adaivskenan.pattern;