/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.strategy
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月31日       qinjunjie        
 * ============================================================*/

/**
 * <p>STRATEGY</p>
 *	策略模式：策略模式针对一组算法，将每一个算法封装到具有共同接口的独立
 *	的类中，从而使得它们可以相互替换。策略模式使得算法可以在不影响到客户
 *	端的情况下发生变化。策略模式把行为和环境分开。环境类负责维持和查询行
 *	为类，各种算法在具体的策略类中提供。由于算法和环境独立开来，算法的增
 *	减，修改都不会影响到环境和客户端。
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月31日
 */

package com.adaivskenan.gof.strategy;