/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.utils.my
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年4月4日       qinjunjie        
 * ============================================================*/

/**
 * <p>TODO 类描述</p>
 *
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年4月4日
 */

package com.adaivskenan.utils.my;