/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.command
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月31日       qinjunjie        
 * ============================================================*/

/**
 * <p>COMMAND</p>
 *	命令模式：命令模式把一个请求或者操作封装到一个对象中。命令模式把发
 *	出命令的责任和执行命令的责任分割开，委派给不同的对象。命令模式允许
 *	请求的一方和发送的一方独立开来，使得请求的一方不必知道接收请求的一
 *	方的接口，更不必知道请求是怎么被接收，以及操作是否执行，何时被执行
 *	以及是怎么被执行的。系统支持命令的撤消。
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月31日
 */

package com.adaivskenan.gof.command;