/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.memento
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月31日       qinjunjie        
 * ============================================================*/

/**
 * <p>MEMENTO</p>
 *	备忘录模式：备忘录对象是一个用来存储另外一个对象内部状态的快照的对
 *	象。备忘录模式的用意是在不破坏封装的条件下，将一个对象的状态捉住，
 *	并外部化，存储起来，从而可以在将来合适的时候把这个对象还原到存储起
 *	来的状态。
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月31日
 */

package com.adaivskenan.gof.memento;