/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.state
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月31日       qinjunjie        
 * ============================================================*/

/**
 * <p>STATE</p>
 *	状态模式：状态模式允许一个对象在其内部状态改变的时候改变行为。这个
 *	对象看上去象是改变了它的类一样。状态模式把所研究的对象的行为包装在
 *	不同的状态对象里，每一个状态对象都属于一个抽象状态类的一个子类。状
 *	态模式的意图是让一个对象在其内部状态改变的时候，其行为也随之改变。
 *	状态模式需要对每一个系统可能取得的状态创立一个状态类的子类。当系统
 *	的状态变化时，系统便改变所选的子类。
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月31日
 */

package com.adaivskenan.gof.state;