/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.decorator
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月31日       qinjunjie        
 * ============================================================*/

/**
 * <p>DECORATOR</p>
 *	装饰模式：装饰模式以对客户端透明的方式扩展对象的功能，是继承关系的
 *	一个替代方案，提供比继承更多的灵活性。动态给一个对象增加功能，这些
 *	功能可以再动态的撤消。增加由一些基本功能的排列组合而产生的非常大量
 *	的功能。
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月31日
 */

package com.adaivskenan.gof.decorator;