/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.composite
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月31日       qinjunjie        
 * ============================================================*/

/**
 * <p>COMPOSITE</p>
 *	合成模式：合成模式将对象组织到树结构中，可以用来描述整体与部分的关
 *系。合成模式就是一个处理对象的树结构的模式。合成模式把部分与整体的关
 *系用树结构表示出来。合成模式使得客户端把一个个单独的成分对象和由他们
 *复合而成的合成对象同等看待。
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月31日
 */

package com.adaivskenan.gof.composite;