/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2012
 * 包： com.adaivskenan.test.javax.net.ssl
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年12月10日       qinjunjie        
 * ============================================================*/

/**
 * <p>ssl 相关测试</p>
 *
 * <p>Copyright: 版权所有 (c) 2002 - 2008<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年12月10日
 */

package com.adaivskenan.test.javax.net.ssl;