/**============================================================
 * 版权： 久其软件 版权所有 (c) 2002 - 2016
 * 包： com.adaivskenan.gof.mediator
 * 修改记录：
 * 日期                作者           内容
 * =============================================================
 * 2018年1月31日       qinjunjie        
 * ============================================================*/

/**
 * <p>MEDIATOR</p>
 *	调停者模式：调停者模式包装了一系列对象相互作用的方式，使得这些对象
 *	不必相互明显作用。从而使他们可以松散偶合。当某些对象之间的作用发生
 *	改变时，不会立即影响其他的一些对象之间的作用。保证这些作用可以彼此
 *	独立的变化。调停者模式将多对多的相互作用转化为一对多的相互作用。调
 *	停者模式将对象的行为和协作抽象化，把对象在小尺度的行为上与其他
	的相互作用分开处理。
 * <p>Copyright: 版权所有 (c) 2002 - 2016<br>
 * Company: 久其</p>
 *
 * @author qinjunjie
 * @version 2018年1月31日
 */

package com.adaivskenan.gof.mediator;